app/controllers/blog_posts_controller.rb

SELECT "blog_posts".* FROM "blog_posts"
---
    def index
      @blog_posts = BlogPost.all

INSERT INTO "blog_posts" ("title", "content", "user_id", "created_at", "updated_at", "image_url") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
    def create
      @blog_post = current_user.blog_posts.build(blog_post_params)
      if @blog_post.save

UPDATE "blog_posts" SET "content" = $1, "updated_at" = $2 WHERE "blog_posts"."id" = $3  [["content", "Test12"], ["updated_at", "2024-06-09 14:24:58.972720"], ["id", 3]]
---
    def update
      if @blog_post.update(blog_post_params)

DELETE FROM "blog_posts" WHERE "blog_posts"."id" = $1  [["id", 4]]
---
    def destroy
      @blog_post.destroy

SELECT "blog_posts".* FROM "blog_posts" WHERE "blog_posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_blog_post
      @blog_post = BlogPost.find(params[:id])